---
kind: other
id: Methods.T:Autodesk.Revit.DB.ModelArc
source: html/d7afa891-e3d2-2737-e978-8cf6d37cd5e9.htm
---
# ModelArc Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.